; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	infrared0 - mode
	infrared1 - mode
	image3 - mode
	image4 - mode
	image2 - mode
	Star3 - direction
	Star4 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon20)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(supports instrument2 image4)
	(calibration_target instrument2 Star4)
	(supports instrument3 image4)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument4 infrared1)
	(supports instrument4 image2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(supports instrument6 image3)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon17)
	(supports instrument7 image2)
	(supports instrument7 image4)
	(supports instrument7 image3)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Planet6)
	(pointing satellite2 Star13)
	(pointing satellite3 Phenomenon10)
	(pointing satellite4 Phenomenon14)
	(have_image Phenomenon5 infrared1)
	(have_image Planet6 image4)
	(have_image Star7 infrared0)
	(have_image Planet8 image3)
	(have_image Planet9 image4)
	(have_image Phenomenon10 infrared0)
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 infrared0)
	(have_image Star13 image2)
	(have_image Phenomenon14 image3)
	(have_image Planet15 image2)
	(have_image Star16 image3)
	(have_image Phenomenon17 infrared1)
	(have_image Phenomenon18 infrared1)
	(have_image Phenomenon19 image2)
	(have_image Phenomenon20 infrared0)
	(have_image Planet21 image2)
	(have_image Planet22 image3)
	(have_image Phenomenon23 image3)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 23
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 23
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 23
4. (turn_to satellite4 groundstation1 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 23
5. (calibrate satellite4 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 23
6. (turn_to satellite4 phenomenon14 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon14)
   goals met: 1 of 23
7. (take_image satellite4 phenomenon14 instrument7 image3)
   added: (have_image phenomenon14 image3)
   goals met: 2 of 23
8. (turn_to satellite3 star0 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 star0)
   goals met: 2 of 23
9. (calibrate satellite3 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 2 of 23
10. (turn_to satellite3 phenomenon10 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon10)
   goals met: 3 of 23
11. (turn_to satellite2 star13 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star13)
   goals met: 4 of 23
12. (turn_to satellite0 groundstation1 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 23
13. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 4 of 23
14. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 23
15. (take_image satellite0 phenomenon10 instrument0 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 5 of 23
16. (turn_to satellite0 phenomenon12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 23
17. (take_image satellite0 phenomenon12 instrument0 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 6 of 23
18. (turn_to satellite0 phenomenon17 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon17)
   goals met: 6 of 23
19. (take_image satellite0 phenomenon17 instrument0 infrared1)
   added: (have_image phenomenon17 infrared1)
   goals met: 7 of 23
20. (turn_to satellite0 phenomenon18 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon18)
   goals met: 7 of 23
21. (take_image satellite0 phenomenon18 instrument0 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 8 of 23
22. (turn_to satellite0 phenomenon20 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon20)
   goals met: 8 of 23
23. (take_image satellite0 phenomenon20 instrument0 infrared0)
   added: (have_image phenomenon20 infrared0)
   goals met: 9 of 23
24. (turn_to satellite0 phenomenon5 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon5)
   goals met: 9 of 23
25. (take_image satellite0 phenomenon5 instrument0 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 10 of 23
26. (turn_to satellite0 planet11 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet11)
   goals met: 10 of 23
27. (take_image satellite0 planet11 instrument0 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 11 of 23
28. (turn_to satellite0 planet6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet6)
   goals met: 12 of 23
29. (turn_to satellite4 phenomenon19 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon19)
   goals met: 11 of 23
30. (take_image satellite4 phenomenon19 instrument7 image2)
   added: (have_image phenomenon19 image2)
   goals met: 12 of 23
31. (turn_to satellite4 phenomenon14 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 phenomenon14)
   goals met: 13 of 23
32. (turn_to satellite4 phenomenon23 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon23)
   goals met: 12 of 23
33. (take_image satellite4 phenomenon23 instrument7 image3)
   added: (have_image phenomenon23 image3)
   goals met: 13 of 23
34. (turn_to satellite4 phenomenon14 phenomenon23)
   deleted: (pointing satellite4 phenomenon23)
   added: (pointing satellite4 phenomenon14)
   goals met: 14 of 23
35. (turn_to satellite4 planet15 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 planet15)
   goals met: 13 of 23
36. (take_image satellite4 planet15 instrument7 image2)
   added: (have_image planet15 image2)
   goals met: 14 of 23
37. (turn_to satellite4 phenomenon14 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 phenomenon14)
   goals met: 15 of 23
38. (turn_to satellite4 planet21 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 planet21)
   goals met: 14 of 23
39. (take_image satellite4 planet21 instrument7 image2)
   added: (have_image planet21 image2)
   goals met: 15 of 23
40. (turn_to satellite4 phenomenon14 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 phenomenon14)
   goals met: 16 of 23
41. (turn_to satellite4 planet22 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 planet22)
   goals met: 15 of 23
42. (take_image satellite4 planet22 instrument7 image3)
   added: (have_image planet22 image3)
   goals met: 16 of 23
43. (turn_to satellite4 phenomenon14 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 phenomenon14)
   goals met: 17 of 23
44. (turn_to satellite4 planet6 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 planet6)
   goals met: 16 of 23
45. (take_image satellite4 planet6 instrument7 image4)
   added: (have_image planet6 image4)
   goals met: 17 of 23
46. (turn_to satellite4 phenomenon14 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 phenomenon14)
   goals met: 18 of 23
47. (turn_to satellite4 planet8 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 planet8)
   goals met: 17 of 23
48. (take_image satellite4 planet8 instrument7 image3)
   added: (have_image planet8 image3)
   goals met: 18 of 23
49. (turn_to satellite4 phenomenon14 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 phenomenon14)
   goals met: 19 of 23
50. (turn_to satellite4 planet9 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 planet9)
   goals met: 18 of 23
51. (take_image satellite4 planet9 instrument7 image4)
   added: (have_image planet9 image4)
   goals met: 19 of 23
52. (turn_to satellite4 phenomenon14 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 phenomenon14)
   goals met: 20 of 23
53. (turn_to satellite4 star13 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 star13)
   goals met: 19 of 23
54. (take_image satellite4 star13 instrument7 image2)
   added: (have_image star13 image2)
   goals met: 20 of 23
55. (turn_to satellite4 phenomenon14 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 phenomenon14)
   goals met: 21 of 23
56. (turn_to satellite4 star16 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 star16)
   goals met: 20 of 23
57. (take_image satellite4 star16 instrument7 image3)
   added: (have_image star16 image3)
   goals met: 21 of 23
58. (turn_to satellite4 phenomenon14 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 phenomenon14)
   goals met: 22 of 23
59. (turn_to satellite0 star7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star7)
   goals met: 21 of 23
60. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 22 of 23
61. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 23 of 23
